# FamilyIsCorruptError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FamilyIsCorruptError Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Some families have become unusable. Reload the families, or delete them from the model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyIsCorruptError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyIsCorruptError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyIsCorruptError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace